# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
# a = int(input('Введите цифру дня недели '))
# if a == 6 or a == 7:
#     print(f'{a} - выходной день')
# else:
#     print(f'{a} - будний день' )


# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0
# и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

# x = int(input('Введите значение x '))
# y = int(input('Введите значение y '))
# if x != 0 and y != 0:
#     if x > 0 and y > 0:
#         print('1 плоскость')
#     elif x < 0 and y > 0:
#         print('2 плоскость')
#     elif x < 0 and y < 0:
#         print('3 плоскость')
#     elif x > 0 and y < 0:
#         print('4 плоскость')

