# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
# a = int(input('Введите цифру дня недели '))
# if a == 6 or a == 7:
#     print(f'{a} - выходной день')
# else:
#     print(f'{a} - будний день' )


# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0
# и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

# x = int(input('Введите значение x '))
# y = int(input('Введите значение y '))
# if x != 0 and y != 0:
#     if x > 0 and y > 0:
#         print('1 плоскость')
#     elif x < 0 and y > 0:
#         print('2 плоскость')
#     elif x < 0 and y < 0:
#         print('3 плоскость')
#     elif x > 0 and y < 0:
#         print('4 плоскость')

# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).
# a = int(input('Введите номер четверти '))
# if a == 1:
#     print('x > 0, y > 0 ')
# elif a == 2:
#     print('x < 0, y > 0')
# elif a == 3:
#     print('x < 0, y < 0')
# elif a == 4:
#     print('x > 0, y < 0')
# elif a > 4:
#     print('Такой четверти нет')

# Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве.

# x_1 = int(input('Введите абсциссу точки A '))
# y_1 = int(input('Введите ординату точки A '))
# x_2 = int(input('Введите абсциссу точки B '))
# y_2 = int(input('Введите ординату точки B '))
#
#
# result = ((x_2-x_1)**2 + (y_2-y_1)**2)**0.5
# result = round(result, 3)
# print(f'Расстояние между точками A и B равно {result}')

